{"class_name": "Sequential", "keras_version": "2.1.4", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dtype": "float32", "return_sequences": false, "batch_input_shape": [null, 1, 4], "unit_forget_bias": true, "stateful": false, "name": "lstm_1", "return_state": false, "kernel_constraint": null, "go_backwards": false, "bias_regularizer": null, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_regularizer": null, "units": 50, "trainable": true, "implementation": 1, "dropout": 0.0, "recurrent_constraint": null, "recurrent_regularizer": null, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_dropout": 0.0}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "trainable": true, "activation": "linear", "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}